# Используем базовый образ
FROM node:22

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальной код приложения
COPY . .

# Создаем .env файл из переменной окружения
# Переменные окружения должны быть переданы на этапе сборки
ARG ENV_FILE_CONTENT
RUN echo "$ENV_FILE_CONTENT" > .env

# Собираем проект (если необходимо)
RUN npm run build

# Экспонируем порт, который будет использоваться приложением
EXPOSE 3000

# Команда для запуска приложения
CMD ["npm", "start"]
